// Измерение майнкарфта перенесётся в реальную жизнь, если Х будет равен 10, да?
let x;
alert('Берем измерение майнкрафта');
alert('Оно будет переноситься в реальный мир, если Х будет равен 10');
alert('Да?');
let hp = prompt('У тебя сейчас..?');
let del = prompt('Мы делим на...');
x = hp / del;
let message;
// console.log (type_hp);
while (x !=10){

    if (x != 10) {
        alert('Это будет...');
        alert('Бля, это будет... ');
        alert('Сука, а сколько это будет?');
        alert('Ёбаная физика');
        alert('Ладна, похожу это правда!');
        message = 'Измерение майнкрафта не перенеслось в реальный мир';
        alert(message);
        alert('Бля, шо за хуйня, оно не сходиться!');
        let hp = prompt('А если я возьму...');
        let del = prompt('Поделю на...');
        x  = hp / del;
    }
}
alert ('Это будет 10! °o°');
message = 'Измерение майнкрафта перенеслось в реальный мир';
alert(message);
